#include "foc.h"
#include "pid.h"

/**
 * @brief LA034-040NN07A
 * 极对数：手转一圈电机，两相间出现的正弦波数
 * 相间电阻(三粗线): 13.5~13.8
 * 相电阻 = 相间电阻/2 = 6.75
 *
 */

// https://blog.csdn.net/weixin_42887190/article/details/124289307

// 移相: https://shequ.stmicroelectronics.cn/thread-612527-1-1.html

/**
 *  Ia = Im * cos(θ)
 *  Ib = Im * cos(θ-2π/3)
 *  Ic = Im * cos(θ-4π/3)
 *     = Im * cos(θ+2π/3)
 *
 *  Ia + Ib + Ic = 0 (基尔霍夫定律)
 *
 */

// a-b-c to alpha-beta (clark)
// alpha-beta to d-q (park)
// d-q to alpha-beta (inv park)

#define FMT 1  // 0:Q, 1:F

#include "tim.h"

#define Q15(n)        (int16_t)(32768 * (n))
#define Q15_Mul(a, b) (int16_t)(((int32_t)(a) * (int32_t)(b)) >> 15)
#define Q15_Div(a, b) (int16_t)((int32_t)(a) / ((int32_t)(b) >> 15))
#define Q15_Add(a, b) (int16_t)((int32_t)(a) + (int32_t)(b))

typedef int16_t q15_t;

#define qType      q15_t
#define qConst(n)  Q15(n)
#define qMul(a, b) Q15_Mul(a, b)
#define qDiv(a, b) Q15_Div(a, b)
#define qAdd(a, b) Q15_Add(a, b)

// sincostab16 in 10-bit resolution
static const int16_t sincostab[1024] = {
    0, 201, 402, 603, 804, 1005, 1206, 1407, 1608, 1809, 2009, 2210, 2410, 2611, 2811, 3012, 3212, 3412, 3612, 3811, 4011, 4210, 4410, 4609,
    4808, 5007, 5205, 5404, 5602, 5800, 5998, 6195, 6393, 6590, 6786, 6983, 7179, 7375, 7571, 7767, 7962, 8157, 8351, 8545, 8739, 8933, 9126, 9319,
    9512, 9704, 9896, 10087, 10278, 10469, 10659, 10849, 11039, 11228, 11417, 11605, 11793, 11980, 12167, 12353, 12539, 12725, 12910, 13094, 13279, 13462, 13645, 13828,
    14010, 14191, 14372, 14553, 14732, 14912, 15090, 15269, 15446, 15623, 15800, 15976, 16151, 16325, 16499, 16673, 16846, 17018, 17189, 17360, 17530, 17700, 17869, 18037,
    18204, 18371, 18537, 18703, 18868, 19032, 19195, 19357, 19519, 19680, 19841, 20000, 20159, 20317, 20475, 20631, 20787, 20942, 21096, 21250, 21403, 21554, 21705, 21856,
    22005, 22154, 22301, 22448, 22594, 22739, 22884, 23027, 23170, 23311, 23452, 23592, 23731, 23870, 24007, 24143, 24279, 24413, 24547, 24680, 24811, 24942, 25072, 25201,
    25329, 25456, 25582, 25708, 25832, 25955, 26077, 26198, 26319, 26438, 26556, 26674, 26790, 26905, 27019, 27133, 27245, 27356, 27466, 27575, 27683, 27790, 27896, 28001,
    28105, 28208, 28310, 28411, 28510, 28609, 28706, 28803, 28898, 28992, 29085, 29177, 29268, 29358, 29447, 29534, 29621, 29706, 29791, 29874, 29956, 30037, 30117, 30195,
    30273, 30349, 30424, 30498, 30571, 30643, 30714, 30783, 30852, 30919, 30985, 31050, 31113, 31176, 31237, 31297, 31356, 31414, 31470, 31526, 31580, 31633, 31685, 31736,
    31785, 31833, 31880, 31926, 31971, 32014, 32057, 32098, 32137, 32176, 32213, 32250, 32285, 32318, 32351, 32382, 32412, 32441, 32469, 32495, 32521, 32545, 32567, 32589,
    32609, 32628, 32646, 32663, 32678, 32692, 32705, 32717, 32728, 32737, 32745, 32752, 32757, 32761, 32765, 32766, 32767, 32766, 32765, 32761, 32757, 32752, 32745, 32737,
    32728, 32717, 32705, 32692, 32678, 32663, 32646, 32628, 32609, 32589, 32567, 32545, 32521, 32495, 32469, 32441, 32412, 32382, 32351, 32318, 32285, 32250, 32213, 32176,
    32137, 32098, 32057, 32014, 31971, 31926, 31880, 31833, 31785, 31736, 31685, 31633, 31580, 31526, 31470, 31414, 31356, 31297, 31237, 31176, 31113, 31050, 30985, 30919,
    30852, 30783, 30714, 30643, 30571, 30498, 30424, 30349, 30273, 30195, 30117, 30037, 29956, 29874, 29791, 29706, 29621, 29534, 29447, 29358, 29268, 29177, 29085, 28992,
    28898, 28803, 28706, 28609, 28510, 28411, 28310, 28208, 28105, 28001, 27896, 27790, 27683, 27575, 27466, 27356, 27245, 27133, 27019, 26905, 26790, 26674, 26556, 26438,
    26319, 26198, 26077, 25955, 25832, 25708, 25582, 25456, 25329, 25201, 25072, 24942, 24811, 24680, 24547, 24413, 24279, 24143, 24007, 23870, 23731, 23592, 23452, 23311,
    23170, 23027, 22884, 22739, 22594, 22448, 22301, 22154, 22005, 21856, 21705, 21554, 21403, 21250, 21096, 20942, 20787, 20631, 20475, 20317, 20159, 20000, 19841, 19680,
    19519, 19357, 19195, 19032, 18868, 18703, 18537, 18371, 18204, 18037, 17869, 17700, 17530, 17360, 17189, 17018, 16846, 16673, 16499, 16325, 16151, 15976, 15800, 15623,
    15446, 15269, 15090, 14912, 14732, 14553, 14372, 14191, 14010, 13828, 13645, 13462, 13279, 13094, 12910, 12725, 12539, 12353, 12167, 11980, 11793, 11605, 11417, 11228,
    11039, 10849, 10659, 10469, 10278, 10087, 9896, 9704, 9512, 9319, 9126, 8933, 8739, 8545, 8351, 8157, 7962, 7767, 7571, 7375, 7179, 6983, 6786, 6590,
    6393, 6195, 5998, 5800, 5602, 5404, 5205, 5007, 4808, 4609, 4410, 4210, 4011, 3811, 3612, 3412, 3212, 3012, 2811, 2611, 2410, 2210, 2009, 1809,
    1608, 1407, 1206, 1005, 804, 603, 402, 201, 0, -201, -402, -603, -804, -1005, -1206, -1407, -1608, -1809, -2009, -2210, -2410, -2611, -2811, -3012,
    -3212, -3412, -3612, -3811, -4011, -4210, -4410, -4609, -4808, -5007, -5205, -5404, -5602, -5800, -5998, -6195, -6393, -6590, -6786, -6983, -7179, -7375, -7571, -7767,
    -7962, -8157, -8351, -8545, -8739, -8933, -9126, -9319, -9512, -9704, -9896, -10087, -10278, -10469, -10659, -10849, -11039, -11228, -11417, -11605, -11793, -11980, -12167, -12353,
    -12539, -12725, -12910, -13094, -13279, -13462, -13645, -13828, -14010, -14191, -14372, -14553, -14732, -14912, -15090, -15269, -15446, -15623, -15800, -15976, -16151, -16325, -16499, -16673,
    -16846, -17018, -17189, -17360, -17530, -17700, -17869, -18037, -18204, -18371, -18537, -18703, -18868, -19032, -19195, -19357, -19519, -19680, -19841, -20000, -20159, -20317, -20475, -20631,
    -20787, -20942, -21096, -21250, -21403, -21554, -21705, -21856, -22005, -22154, -22301, -22448, -22594, -22739, -22884, -23027, -23170, -23311, -23452, -23592, -23731, -23870, -24007, -24143,
    -24279, -24413, -24547, -24680, -24811, -24942, -25072, -25201, -25329, -25456, -25582, -25708, -25832, -25955, -26077, -26198, -26319, -26438, -26556, -26674, -26790, -26905, -27019, -27133,
    -27245, -27356, -27466, -27575, -27683, -27790, -27896, -28001, -28105, -28208, -28310, -28411, -28510, -28609, -28706, -28803, -28898, -28992, -29085, -29177, -29268, -29358, -29447, -29534,
    -29621, -29706, -29791, -29874, -29956, -30037, -30117, -30195, -30273, -30349, -30424, -30498, -30571, -30643, -30714, -30783, -30852, -30919, -30985, -31050, -31113, -31176, -31237, -31297,
    -31356, -31414, -31470, -31526, -31580, -31633, -31685, -31736, -31785, -31833, -31880, -31926, -31971, -32014, -32057, -32098, -32137, -32176, -32213, -32250, -32285, -32318, -32351, -32382,
    -32412, -32441, -32469, -32495, -32521, -32545, -32567, -32589, -32609, -32628, -32646, -32663, -32678, -32692, -32705, -32717, -32728, -32737, -32745, -32752, -32757, -32761, -32765, -32766,
    -32767, -32766, -32765, -32761, -32757, -32752, -32745, -32737, -32728, -32717, -32705, -32692, -32678, -32663, -32646, -32628, -32609, -32589, -32567, -32545, -32521, -32495, -32469, -32441,
    -32412, -32382, -32351, -32318, -32285, -32250, -32213, -32176, -32137, -32098, -32057, -32014, -31971, -31926, -31880, -31833, -31785, -31736, -31685, -31633, -31580, -31526, -31470, -31414,
    -31356, -31297, -31237, -31176, -31113, -31050, -30985, -30919, -30852, -30783, -30714, -30643, -30571, -30498, -30424, -30349, -30273, -30195, -30117, -30037, -29956, -29874, -29791, -29706,
    -29621, -29534, -29447, -29358, -29268, -29177, -29085, -28992, -28898, -28803, -28706, -28609, -28510, -28411, -28310, -28208, -28105, -28001, -27896, -27790, -27683, -27575, -27466, -27356,
    -27245, -27133, -27019, -26905, -26790, -26674, -26556, -26438, -26319, -26198, -26077, -25955, -25832, -25708, -25582, -25456, -25329, -25201, -25072, -24942, -24811, -24680, -24547, -24413,
    -24279, -24143, -24007, -23870, -23731, -23592, -23452, -23311, -23170, -23027, -22884, -22739, -22594, -22448, -22301, -22154, -22005, -21856, -21705, -21554, -21403, -21250, -21096, -20942,
    -20787, -20631, -20475, -20317, -20159, -20000, -19841, -19680, -19519, -19357, -19195, -19032, -18868, -18703, -18537, -18371, -18204, -18037, -17869, -17700, -17530, -17360, -17189, -17018,
    -16846, -16673, -16499, -16325, -16151, -15976, -15800, -15623, -15446, -15269, -15090, -14912, -14732, -14553, -14372, -14191, -14010, -13828, -13645, -13462, -13279, -13094, -12910, -12725,
    -12539, -12353, -12167, -11980, -11793, -11605, -11417, -11228, -11039, -10849, -10659, -10469, -10278, -10087, -9896, -9704, -9512, -9319, -9126, -8933, -8739, -8545, -8351, -8157,
    -7962, -7767, -7571, -7375, -7179, -6983, -6786, -6590, -6393, -6195, -5998, -5800, -5602, -5404, -5205, -5007, -4808, -4609, -4410, -4210, -4011, -3811, -3612, -3412,
    -3212, -3012, -2811, -2611, -2410, -2210, -2009, -1809, -1608, -1407, -1206, -1005, -804, -603, -402, -201};

void clarke(clarke_t* v)
{
#if FMT
    v->alpha = v->phase_a;
    v->beta  = (v->phase_a + v->phase_b * 2) * M_INVSQRT3;
#else
    v->alpha = v->phase_a;
    v->beta  = qMul(v->phase_a + v->phase_b * 2, qConst(M_INVSQRT3));
#endif
}

void iclarke(iclarke_t* v)
{
    v->phase_a = v->alpha;
    v->phase_b = +0.5 * (M_SQRT3 * v->beta - v->alpha);
    v->phase_c = -0.5 * (M_SQRT3 * v->beta + v->alpha);
}

void park(park_t* v)
{
#if FMT
    v->d = v->alpha * v->cos + v->beta * v->sin;
    v->q = v->beta * v->cos - v->alpha * v->sin;
#else
    v->d = qMul(v->alpha, v->cos) + qMul(v->beta, v->sin);
    v->q = qMul(v->beta, v->cos) - qMul(v->alpha, v->sin);
#endif
}

void ipark(ipark_t* v)
{
#if FMT
    v->alpha = v->d * v->cos - v->q * v->sin;
    v->beta  = v->d * v->sin + v->q * v->cos;
#else
    v->alpha = qMul(v->d, v->cos) - qMul(v->q, v->sin);
    v->beta  = qMul(v->d, v->sin) + qMul(v->q, v->cos);
#endif
}

void minmax(svpwm_t* v)
{
    if (v->phase_a >= v->phase_b)
    {
        if (v->phase_a >= v->phase_c)
        {
            if (v->phase_b >= v->phase_c)
            {
                v->sector    = SECTOR_1;
                v->phase_max = v->phase_a;
                v->phase_mid = v->phase_b;
                v->phase_min = v->phase_c;
            }
            else
            {
                v->sector    = SECTOR_6;
                v->phase_max = v->phase_a;
                v->phase_mid = v->phase_c;
                v->phase_min = v->phase_b;
            }
        }
        else
        {
            v->sector    = SECTOR_5;
            v->phase_max = v->phase_c;
            v->phase_mid = v->phase_a;
            v->phase_min = v->phase_b;
        }
    }
    else
    {
        if (v->phase_a < v->phase_c)
        {
            if (v->phase_b < v->phase_c)
            {
                v->sector    = SECTOR_4;
                v->phase_max = v->phase_c;
                v->phase_mid = v->phase_b;
                v->phase_min = v->phase_a;
            }
            else
            {
                v->sector    = SECTOR_3;
                v->phase_max = v->phase_b;
                v->phase_mid = v->phase_c;
                v->phase_min = v->phase_a;
            }
        }
        else
        {
            v->sector    = SECTOR_2;
            v->phase_max = v->phase_b;
            v->phase_mid = v->phase_a;
            v->phase_min = v->phase_c;
        }
    }
}

void zero_inject(svpwm_t* v)
{
    // https://blog.csdn.net/happy_baymax/article/details/124328899
    // https://blog.csdn.net/weixin_51545907/article/details/131612824

    // 高频注入的本质，引入一个周期与原信号周期的倍数关系的信号，所有相电压同加/同减同一个值，相间压差不变。

    float32_t V0;

    V0 = -0.5 * (v->phase_min + v->phase_max);  // 均值

    // V0 = -1 - v->phase_min;  // 极小值
    // V0 = 1 - v->phase_max;   // 极大值

    // V0 = (abs(v->phase_max) >= abs(v->phase_min)) ? (1 - v->phase_max) : (-1 - v->phase_min);  // 交替

    v->Ta = v->phase_a + V0;
    v->Tb = v->phase_b + V0;
    v->Tc = v->phase_c + V0;

    // [-32768,+32767] => [-0.5,+0.5]
    v->Ta /= 65535;
    v->Tb /= 65535;
    v->Tc /= 65535;

    // [-0.5,0.5] => [0,1]
    v->Ta += 0.5;
    v->Tb += 0.5;
    v->Tc += 0.5;

    v->Ta *= v->period;
    v->Tb *= v->period;
    v->Tc *= v->period;
}

void sincos(sincos_t* v)
{
    // 10-bit resolution
    uint16_t p = v->angle >> 6;  // 0~1023

    // [-1,1] => [-32678,32767]
    v->sin = sincostab[p];
    v->cos = sincostab[(p + 256) & 0x03FF];
}

void svpwm7(svpwm_t* v, iclarke_t* k)  // 和下方的 svpwm7 是完全等效的
{
    f32 X = k->beta;
    f32 Y = (k->beta + M_SQRT3 * k->alpha) * 0.5f;
    f32 Z = Y - X;

    v->sector = 3;

    if (Y > 0)
    {
        v->sector -= 1;
    }
    if (Z > 0)
    {
        v->sector -= 1;
    }
    if (X < 0)
    {
        v->sector = 7 - v->sector;
    }

    switch (v->sector)
    {
        case 1:
        case 4: {
            v->Ta = Y;
            v->Tb = X - Z;
            v->Tc = -Y;
            break;
        }
        case 2:
        case 5: {
            v->Ta = Z + Y;
            v->Tb = X;
            v->Tc = -X;
            break;
        }
        default:
        case 3:
        case 6: {
            v->Ta = Z;
            v->Tb = -Z;
            v->Tc = -(X + Y);
            break;
        }
    }

    // [-32768,+32767] => [-0.5,+0.5]
    v->Ta /= 65535;
    v->Tb /= 65535;
    v->Tc /= 65535;

    // [-0.5,0.5] => [0,1]
    v->Ta += 0.5;
    v->Tb += 0.5;
    v->Tc += 0.5;

    v->Ta *= v->period;
    v->Tb *= v->period;
    v->Tc *= v->period;
}

#include "system/sleep.h"

static PID_t SpdPid = {.Kp = 0.005, .Ki = 0.001, .Kd = 0.0, .ref = 0, .ramp = 0, .lo = -32000, .hi = 32000, .Ts = 1.f / 8e3};
static PID_t IdPid  = {.Kp = 0.001, .Ki = 0.003, .Kd = 0.0, .ref = 0, .ramp = 10000, .lo = -32768, .hi = 32767, .Ts = 1.f / 2e3};
static PID_t IqPid  = {.Kp = 0.001, .Ki = 0.003, .Kd = 0.0, .ref = 0, .ramp = 10000, .lo = -32768, .hi = 32767, .Ts = 1.f / 2e3};

#include "motdrv/enc/hall.h"

void spdloop()
{
#if 1

    PeriodCall(125 * UNIT_US, {
        // Speed Loop 8kHz

        if (ParaTbl.u16RunState)
        {
            if (ParaTbl.u16ElecAngSrc != ELEC_ANG_SRC_NONE)
            {
                ParaTbl.s16SpdTgt = ParaTbl.s16SpdDigRef;

                SpdPid.Kp = ParaTbl.s16SpdKp / 1000.f;
                SpdPid.Ki = ParaTbl.s16SpdKi / 1000.f;

                SpdPid.fbk = ParaTbl.s16SpdFb;
                SpdPid.ref = ParaTbl.s16SpdTgt;
                PID_Handler_Tustin(&SpdPid);

                ParaTbl.s16VqRef = SpdPid.out;
            }
        }
        else
        {
            // 积分清0
            SpdPid.inte = 0;
            SpdPid.err  = 0;
        }
    });

#else

#endif
}

static int curloop_i = 0;

void curloop(void)
{
#if 1

    PeriodCall(500 * UNIT_US, {
        // Speed Loop 2kHz

        if (ParaTbl.u16RunState && 0)
        {
            if (ParaTbl.u16ElecAngSrc != ELEC_ANG_SRC_NONE)
            {
                // IdPid.fbk = ParaTbl.s16IdFb;
                // IdPid.ref = ParaTbl.s16VdRef;
                // PID_Handler_Tustin(&IdPid);

                // ParaTbl.s16VdRef = IdPid.out;

                // IqPid.fbk = ParaTbl.s16IqFb;
                // IqPid.ref = ParaTbl.s16VqRef;
                // PID_Handler_Tustin(&IqPid);

                // ParaTbl.s16VqRef = IqPid.out;
            }
        }
        else
        {
            // 积分清0
            IdPid.inte = 0;
            IdPid.err  = 0;
            IqPid.inte = 0;
            IqPid.err  = 0;
        }
    });

#else

#endif
}

void ifoc(void)
{
    clarke_t clarke_v = {
        .phase_a = ParaTbl.s16CurPhAFb,
        .phase_b = ParaTbl.s16CurPhBFb,
        .phase_c = ParaTbl.s16CurPhCFb,
    };

    clarke(&clarke_v);

    sincos_t sincos_v = {
        .angle = ParaTbl.u16ElecAngRef,
    };

    sincos(&sincos_v);

    park_t park_v = {

        .alpha = clarke_v.alpha,
        .beta  = clarke_v.beta,

        .sin = sincos_v.sin / 32768.f,
        .cos = sincos_v.cos / 32768.f,
    };

    park(&park_v);

    ParaTbl.s16IdFb = park_v.d;
    ParaTbl.s16IqFb = park_v.q;
}

static volatile int i = 0;

void ofoc(void)
{
    sincos_t sincos_v = {
        .angle = ParaTbl.u16ElecAngRef,
    };

    sincos(&sincos_v);

    ipark_t ipark_v = {
        .d   = ParaTbl.s16VdRef,
        .q   = ParaTbl.s16VqRef,
        .sin = sincos_v.sin / 32768.f,
        .cos = sincos_v.cos / 32768.f,
    };

    ipark(&ipark_v);

    iclarke_t iclarke_v = {
        .alpha = ipark_v.alpha,
        .beta  = ipark_v.beta,
    };

    iclarke(&iclarke_v);

    svpwm_t svpwm_v = {
        .phase_a = iclarke_v.phase_a,
        .phase_b = iclarke_v.phase_b,
        .phase_c = iclarke_v.phase_c,
        .period  = ParaTbl.u16PwmDutyMax,
    };

    minmax(&svpwm_v);
    ParaTbl.u16Sector = svpwm_v.sector;

#if 0
    zero_inject(&svpwm_v);
#else
    // overmod
    svpwm7(&svpwm_v, &iclarke_v);

#endif

    ParaTbl.u16DutyPha = svpwm_v.Ta;
    ParaTbl.u16DutyPhb = svpwm_v.Tb;
    ParaTbl.u16DutyPhc = svpwm_v.Tc;
}

void overmod()
{
#if 0
  
    // Modulation
    float V_to_mod = 1.0f / ((2.0f / 3.0f) * v->Umdc);
    float mod_d    = V_to_mod * v->d;
    float mod_q    = V_to_mod * v->q;

    // Vector modulation saturation, lock integrator if saturated
    float mod_scalefactor = 0.80f * M_SQRT3 * 0.5f / sqrtf(mod_d * mod_d + mod_q * mod_q);
    if (mod_scalefactor < 1.0f)
    {
        mod_d *= mod_scalefactor;
        mod_q *= mod_scalefactor;
    }

    v->d = mod_d;
    v->q = mod_q;

#endif
}
